Repository: lerastromtsova/Malicious-Bot-Detection
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru, uk

source: Methods
ru: Методы
uk: Методи

source: Contact
ru: Контакты
uk: Контакти

source: Language
ru: Язык
uk: Мова

source: Check if a VK user is a bot or real human in three simple steps
ru: Проверьте, является ли пользователь ВК ботом или настоящим человеком, за три простых шага
uk: Перевірте, чи є користувач ВК ботом чи справжньою людиною за три прості кроки

source: Step 3
ru: Шаг 3
uk: Крок 3

source: Get the result!
ru: Готово!
uk: Отримайте результат!

source: This user is likely a bot
ru: Скорее всего, этот пользователь - бот
uk: Швидше за все, цей користувач - бот

source: This user does not appear to be a bot
ru: Скорее всего, этот пользователь - не бот
uk: Швидше за все, цей користувач – не бот

source: Contact me if you have any questions or comments
ru: Свяжитесь со мной, если у вас есть вопросы или комментарии
uk: Зв'яжіться зi мною, якщо у вас є запитання чи пропозиції

source: Valeriia Stromtcova
ru: Валерия Стромцова
uk: Валерія Стромцова

source: Master's student at the University of Passau and HSE University
ru: Студентка магистратуры в университете Пассау и НИУ ВШЭ
uk: Магістр Університету Пассау та Університету ВШЕ

source: Step 2
ru: Шаг 2
uk: Крок 2

source: Choose a user from the list below. If you have not found the person you are looking for, try refining your search.
ru: Выберите пользователя из списка ниже. Если вы не нашли того, кого искали, попробуйте уточнить поисковый запрос.
uk: Виберіть користувача зі списку нижче. Якщо ви не знайшли людину, яку шукаєте, спробуйте уточнити пошук.

source: Step 1
ru: Шаг 1
uk: Крок 1

source: Enter a user ID or user name in the search box below.
ru: Введите ID или имя пользователя в поисковой строке ниже.
uk: Введіть ідентифікатор користувача або ім’я користувача у вікні пошуку нижче.

source: Paste a user ID or name
ru: Вставьте ID или имя пользователя
uk: Вставте ідентифікатор користувача або ім’я

source: SEARCH
ru: ПОИСК
uk: ПОШУК

source: Could not find the user you specified. Try refining your search query.
ru: Пользователь не найден. Попробуйте задать более точный поисковый запрос.
uk: Користувач не знайдений. Спробуйте вказати більш точний пошуковий запит.

source: Check
ru: Проверить
uk: Перевірити

source: Thank you!
ru: Спасибо!
uk: Спасибі вам!

source: Here is your completion code:
ru: Ваш код завершения для платформы Prolific:
uk: Ось ваш код завершення для Prolific:

source: Justify your decisions
ru: Обоснуйте свой выбор
uk: Обґрунтуйте свої рішення

source: In the form below, please shortly describe which criteria you used to label users.
ru: В форме ниже, пожалуйста, кратко опишите, на чём вы основывали свои решения при классификации пользователей.
uk: У формі нижче коротко опишіть, які критерії ви використовували для користувачі міток.

source: Enter an explanation
ru: Введите объяснение
uk: Введіть пояснення

source: SUBMIT AND GET COMPLETION CODE
ru: СОХРАНИТЬ И ЗАВЕРШИТЬ
uk: НАДІСЛАТИ І ОТРИМАТИ КОД ЗАВЕРШЕННЯ

source: Enter your Prolific ID
ru: Введите свой Prolific ID
uk: Введіть свій Prolific ID

source: Thank you for taking part in our data labelling. First, please enter your Prolific ID.
ru: Спасибо, что принимаете участие в разметке данных для нашего исследования. Пожалуйста, введите свой Prolific ID в форме ниже.
uk: Дякуємо за участь у нашому маркуванні даних. Спочатку введіть свій ідентифікатор Prolific.

source: Label this user
ru: Классифицируйте этого пользователя
uk: Класифікуйте цього користувача

source: Your task is to understand whether this VKontakte user is a social bot or a real human.
ru: Ваша задача - понять, является ли заданный пользователь ВКонтакте социальным ботом или настоящим человеком.
uk: Ваше завдання зрозуміти, чи є цей користувач ВКонтакте соцботом абосправжня людина.

source: Definitions:
ru: Определения:
uk: Визначення:

source: <b>Social bot</b> - a software agent that communicates autonomously on social media. Bots are typically fake accounts with fake personalities.
ru: <b>Социальный бот</b> - программное обеспечение, которое автономно коммуницирует в социальных сетях. Обычно боты - это фейковые, ненастоящие аккаунты с выдуманными личностями.
uk: <b>Соціальний бот</b> – програмний агент, який автономно спілкується на соціальні мережі. Боти - це зазвичай фейкові облікові записи з фейкомособистості.

source: <b>Real human</b> - an account that belongs to a real person and is not managed automatically.
ru: <b>Настоящий человек</b> - аккаунт, принадлежащий настоящему человеку и не управляемый автоматическими средствами.
uk: <b>Справжня людина</b> – обліковий запис, який належить реальній особі, а не є керується автоматично.

source: Please inspect this user and their comments on VKontakte.
ru: Пожалуйста, просмотрите информацию о пользователе и его/её комментарии ВКонтакте.
uk: Будь ласка, перегляньте інформацію про користувача та його/її коментарі ВКонтакте.

source: For each user, you can see their VKontakte page by clicking
ru: Вы можете просмотреть страницу каждого пользователя, нажав на
uk: Для кожного користувача ви можете побачити його сторінку ВКонтакте, натиснувши

source: Open VK page
ru: Открыть страницу ВК
uk: Відкрити сторінку ВК

source: For each comment, you can see the source comment and post by clicking
ru: Вы можете просмотреть каждый комментарий и пост, к которому он оставлен, нажав на
uk: Для кожного коментаря ви можете переглянути вихідний коментар і опублікувати, натиснувши

source: See original post and comment
ru: К исходному посту и комментарию
uk: До вихідного посту та коментарю

source: After you make a decision:
ru: После того, как вы примете решение:
uk: Після прийняття рішення:

source: If you think this user is a bot, press the <b>"BOT" button</b>.
ru: Если вы думаете, что этот пользователь бот, нажмите кнопку <b>"БОТ"</b>.
uk: Якщо ви думаєте, що цей користувач бот, натисніть кнопку <b>"БОТ"</b> внизу.

source: If you think this user is a real human, press the <b>"HUMAN" button</b>.
ru: Если вы думаете, что этот пользователь человек, нажмите кнопку <b>"ЧЕЛОВЕК"</b>.
uk: Якщо ви думаєте, що цей користувач справжня людина, натисніть кнопку <b>"ЛЮДИНА"</b> внизу.

source: Normally, labelling each user should not take more than 5 minutes.
ru: Обычно классификация каждого пользователя не занимает более 5 минут.
uk: Зазвичай позначення кожного користувача не займає більше 5 хвилин.

source: <b>Scroll down</b> to see user info, comments and buttons.
ru: <b>Опуститесь ниже</b>, чтобы увидеть информацию о первом пользователе, его комментарии и кнопки для классификации.
uk: <b>Прокрутіть униз</b>, щоб переглянути інформацію про користувача, коментарі та кнопки.

source: Enter your Prolific user ID
ru: Введите свой Prolific ID
uk: Введіть свій Prolific ID

source: PROCEED
ru: ДАЛЕЕ
uk: ПРОДОВЖИТИ

source: Your Prolific ID
ru: Ваш Prolific ID
uk: Ваш Prolific ID

source: Left to label
ru: Осталось классифицировать
uk: Залишилося позначити

source: BOT
ru: БОТ
uk: БОТ

source: HUMAN
ru: ЧЕЛОВЕК
uk: ЛЮДИНА

source: Our bot detection method is backed by scientific research
ru: Наш метод обнаружения ботов основан на научных исследованиях
uk: Наш метод виявлення ботів ґрунтується на наукових дослідженнях

source: Steps
ru: Шаги
uk: Кроки

source: Our scientific method includes several steps:
ru: Наш метод включает в себя несколько шагов:
uk: Наш метод включає кілька кроків:

source: Retrieve comments related to the Russian-Ukrainian armed conflict of 2022 from VKontakte's most relevant media groups
ru: Парсинг комментариев, связанных с российско-украинским вооруженным конфликтом 2022 года из групп ВКонтакте
uk: Парсинг коментарів, пов'язаних із російсько-українським збройним конфліктом 2022 року з груп ВКонтакте

source: Build a graph of users who have been leaving these comments
ru: Построение сети пользователей, оставивших комментарии
uk: Побудова мережі користувачів, котрі залишили коментарі

source: Cluster the users using Louvain community detection algorithm
ru: Кластеризация сети при помощи алгоритма обнаружения сообществ Louvain

source: Calculate characteristics of each cluster and probability of it being a bot cluster
ru: Вычисление характеристик каждого кластера и вероятности того, что в кластере находятся боты

source: Calculate centrality metrics to identify most influential users in communities
ru: Подсчёт метрик центральности для определения наиболее влиятельных пользователей в кластерах
uk: Підрахунок метрик центральності для визначення найвпливовіших користувачів у кластерах

source: Conduct sentiment analysis to understand the tone conveyed by a cluster
ru: Анализ настроений в комментариях
uk: Аналіз настроїв у коментарях

source: Conduct content analysis to understand the users' ideas and opinions
ru: Анализ содержания комментариев

source: Store this data and make it accessible to you
ru: Сохранение данных и предоставление доступа к ним широкой аудитории
uk: Збереження даних та надання доступу до них широкій аудиторії

source: Dataset
ru: Данные
uk: Дані

source: Currently, we have data about 283 506 users from VKontakte.
ru: Сейчас у нас в базе данных информация о 283 506 пользователях ВКонтакте
uk: Зараз у нас в базі даних інформація про 283 506 користувачів ВКонтакте

source: Reference
ru: Литература
uk: Література

source: The algorithm is based on this scientific paper:
ru: Наш алгоритм основан на научной статье:
uk: Наш алгоритм ґрунтується на науковій статті:

source: written by
ru: , которая написана авторами
uk: , яка написана авторами

source: , and
ru: и

source: After that, do not reload or close the page.
uk: Після цього не перезавантажуйте і не закривайте сторінку.

source: If you see an error, please clear browser cookies and refresh the page.
uk: Якщо ви зустрінете помилку, очистіть куки та перезавантажте сторінку.

source: Identify suspicious clusters with high concentration of bots
uk: Визначення підозрілих кластерів із високою концентрацією ботів
